mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
/**
 *	Keil project for XY-GalvoScanner
 *  29-04-2015
 *
 *
 *	@author		Manuel Del Basso
 *	@email		Manuel.DelBasso@googlemail.com  
 *	@ide		Keil uVision 5
 *	@packs		STM32F4xx Keil packs version 2.2.0 or greater required
 *	@stdperiph	STM32F4xx Standard peripheral drivers version 1.4.0 or greater required
 *
 *	Additional defines in "Options for Target" > "C/C++" > "Defines"
 *		- ARM_MATH_CM4
 *		- __FPU_PRESENT = 1
 */
/* Include core modules */
#include "stm32f4xx.h"
/* Include my libraries here */
#include "defines.h"
#include "tm_stm32f4_delay.h"
//#include "tm_stm32f4_onewire.h"
//#include "tm_stm32f4_ds18b20.h"
//#include "tm_stm32f4_disco.h"
#include "tm_stm32f4_usart.h"
#include "tm_stm32f4_pwm.h"

#include "tm_stm32f4_adc.h"
#include "md_stm32f4_dac.h"
#include "md_stm32f4_disco.h"

#include "tm_stm32f4_timer.h"
#include "defines.h"
//#include "tm_stm32f4_ili9341.h"
//#include "tm_stm32f4_stmpe811.h"


#include <stdio.h>
#include "arm_architect.h"
/* Include ARM math */
#include "arm_math.h"
#include "main.h"
#include "adc_dac_dma.h"
#include "signalGen.h"

#include <string.h>
#include <stdlib.h>
#include "pid.h"
#include "tools.h"
#include "mdb_gpio.h"
#include "stm32f4xx_adc.h"


// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//          IMPORT from MATLAB code generated project pid_lib_v3
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//#include "pid_lib_v3.h"                /* Model's header file */
#include "rtwtypes.h"                  /* MathWorks types */
#include "stm32f4xx.h"

/* RCC_Configuration defined in RCC_Configuration.c file */
/* Clock configuration function provided as example */
void RCC_Configuration(void);

/* Real-time model */
//extern RT_MODEL_pid_lib_v3 *const pid_lib_v3_M;

/* Set which subrates need to run this base step (base rate always runs).*/
/* Defined in pid_lib_v3.c file */
extern void pid_lib_v3_SetEventsForThisBaseStep(boolean_T*);

/* Flags for taskOverrun */
static boolean_T OverrunFlags[1];

/* Number of auto reload timer rotation computed */
static uint32_t autoReloadTimerLoopVal_S = 1;

/* Remaining number of auto reload timer rotation to do */
static uint32_t remainAutoReloadTimerLoopVal_S = 1;

/****************************************************
   SysTick_Handler function
   This handler is called every tick and schedules tasks
 *****************************************************/
void SysTick_Handler(void);
void TimingDelay_Decrement(void);

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//    END of    IMPORT from MATLAB code generated project pid_lib_v3
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


static struct global g;
static struct triangWave triStruct;
static struct autoSaveSystem ass;

static DAC_WritePointer_t (*DAC_SecureSetDualChanSigned) (int16_t, int16_t);

// ==============================================================
//   This is needed in order to provide printf functionality
// ==============================================================
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)

struct __FILE { int handle; /* Add whatever you need here */ };
FILE __stdout;
    
PUTCHAR_PROTOTYPE
{
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART */
    USART_SendData(USART1, (uint8_t) ch);

    /* Loop until the end of transmission */
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
    {}

    return ch;
}


	
// ==============================================================
//                         Prototypes 
// ==============================================================
void gpio_init(void);
void exportInternalClks (void);
void gpio_init_mco1(void);
void gpio_init_mco2(void);
//static void Console (struct PID_DATA *pid, struct FPID_DATA *fpid, structType type);
void resetPID (void);
//void consoleCase (struct PID_DATA *pid);
void adc12_init (uint16_t gpio_pin_adc1, 
								 uint16_t gpio_pin_adc2, 
								 uint16_t EndOfConvInt, 
								 ADC_TypeDef* ADCxEOT);
void fastConsoleCase(arm_pid_instance_f32 *pid);

int updateActuator_f(float I_set_x, float I_set_y);
int beamCtrl(beamCtrlSource_t src, MDB_GPIO_STATE_t newState );


#define RX_FRAME_PADDING_CHAR   '~'

/* The function pointer updateActuator is used as non-privileged access function 
 * to internal DAC output registers. After ass detects a tripping condition ,
 * updateActuator function-pointer targets to updateActuator_fused_callback */
//int (*updateActuator)                (float, float);
//int (*updateActuator_callback)       (float, float);
//int (*updateActuator_fused_callback) (float, float);
// ==============================================================
//                  Compensator things
// ==============================================================
#define ALGO_OLD 				10
#define ADJUSTING_SETPOINT	    11		// Stellungsalgorithmus
#define SPEED_SETPOINT			12		// Geschwindigkeitsalgorithmus
#define ALGORITHM 	ADJUSTING_SETPOINT

/** This is the factor used in the gui to enlarge resolution on int-only
 * QSlider ranges
 */
#define SLIDER_VAL_DEVIDER  10000UL
//int SLIDER_VAL_DEVIDER  = 10000;


//@@@#pragma O0
struct PID_DATA     pidDataX;
struct PID_DATA     pidDataY;
struct FPID_DATA    fpidData;

//@@@#pragma O2

volatile float UNIT_MIKRO = 1/1000000;
volatile int16_t pidOut = 0;

/**< ADC dual mode DMA receive buffer. */
__IO int16_t ADC_MultiConvBuff[5];     
/* ADC values access buffer
 * Because we use a float based instance of PID, we need to cast the 
 * ADC_MultiConvBuff[0] buffer from integral type to float !!!
 */
__IO float ADC_fBuff[5];     
/**< Define indices for ADC_MultiConvBuff[ ] acording to setpoint (INDEX_W) ans
 * process output (INDEX_P). */
#ifndef INDEX_Py
    #define INDEX_Px     0
    #define INDEX_Py     1
    #define INDEX_Ix     2
    #define INDEX_W      3
#endif
/* Acess macros for actual ADC values 
 * 
 * ToDo:    Maybe this macros needs to be atomic! 
 */
#define POS_X_FLOAT         (float) ADC_fBuff[INDEX_Px]	/* actual position */
#define POS_Y_FLOAT         (float) ADC_fBuff[INDEX_Py]	/* actual position */
#define SETPOINT_Y_FLOAT	(float) ADC_fBuff[INDEX_W]	/* position we want to have */

