mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
#define SIGNW -1

#define INTERNAL_SETPOINT 
#undef INTERNAL_SETPOINT 

#pragma O0
    //float temps[EXPECTING_SENSORS];
    
float pidErrBuff[2];        /* PID error buffer*/
#define pidErr_x   pidErrBuff[0]
#define pidErr_y   pidErrBuff[1]

float toPlantBuff[2];        /* PID output buffer*/
#define toPlant_x   toPlantBuff[0]
#define toPlant_y   toPlantBuff[1]

    float duty = 0;             /* Duty cycle for PWM */
    arm_pid_instance_f32 PIDX;   /* ARM PID Instance, float_32 format */
    arm_pid_instance_f32 PIDY;   /* ARM PID Instance, float_32 format */
__IO float toPlant;              /* next actuator value in Volt */
    int16_t toPlant_int;       /* next actuator value integral type */

    int16_t test1 = UPPER_DAC_LIMIT_SIGNED;
    int16_t test2 = LOWER_DAC_LIMIT_SIGNED;
#pragma O2

/* Choose PID parameters */
#define PID_PARAM_KP		0.5			/* Proporcional */
#define PID_PARAM_KI		0.0		/* Integral */
#define PID_PARAM_KD		0.0			/* Derivative */

// ==============================================================
//                      beam interrupter
// ==============================================================
 
// ==============================================================
//                ass - auto shutdown system
// ==============================================================
#define ASS_TRIPPING_LOWER_DEFAULT    -1.2f
#define ASS_TRIPPING_UPPER_DEFAULT    1.2f
#define ASS_SAFEVALUE_DEFAULT         0
#define ASS_TRIPPING_TIME_DEFAULT    0.750f      // s


//#define ASS_100US                   100
// ==============================================================
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// ==============================================================
//      This indices HAVE TO STAY IN SYNC WITH Qt GUI SOURCES 
// ==============================================================
    volatile int NC = 3;		// index 0...2  (short command)
    volatile int FS = 2;		// index 3...4	(fieldsep)
    volatile int NV = 10;	    // index 5...14 (value)
// ==============================================================
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// ==============================================================
    
#define dbg(IO_PIN, LEVEL) ((LEVEL) == 1 ? \
	 GPIO_WriteBit((GPIO_TypeDef*)DBG_IO, IO_PIN, Bit_SET) :\
	 GPIO_WriteBit((GPIO_TypeDef*)DBG_IO, IO_PIN, Bit_RESET))

#define dbgT(IO_PIN) TM_GPIO_TogglePinValue \
                                ((GPIO_TypeDef*)DBG_IO, IO_PIN)

/* Define static usart strings used as GUI error / status messages  
 */
#define  MSG_GUI_UART1_RECV_BUFF_FULL   "@GUI:usart1RecvBuffFull\n"  ///< Inform Gui about a full usart1 buffer
 
// ==============================================================
//            Signal generator things
// ==============================================================

uint16_t sinctr=0;
/*volatile uint16_t tab[1024];

//const int16_t sintab2[]= {0,110,220,329,437,543,647,748,846,941,1032,1119,1201,1279,1351,1418,1479,1534,1583,1626,1662,1692,1714,1730,1739,1741,1735,1723,1704,1678,1645,1606,1560,1508,1449,1385,1316,1241,1161,1076,987,894,798,698,595,490,384,275,165,55,-55,-165,-275,-384,-490,-595,-698,-798,-894,-987,-1076,-1161,-1241,-1316,-1385,-1449,-1508,-1560,-1606,-1645,-1678,-1704,-1723,-1735,-1741,-1739,-1730,-1714,-1692,-1662,-1626,-1583,-1534,-1479,-1418,-1351,-1279,-1201,-1119,-1032,-941,-846,-748,-647,-543,-437,-329,-220,-110,-0};

    //int16_t sintab[]= { 0,262,519,769,1005,1225,1425,1601,1751,1873,
//									1963,2022,2047,2039,1997,1922,1816,1680,1516,
//									1328,1117,889,645,391,131,-131,-391,-645,-889,
//									-1117,-1328,-1516,-1680,-1816,-1922,-1997,-2039,
//								-2047,-2022,-1963,-1873,-1751,-1601,-1425,-1225,
//									-1005,-769,-519,-262,-0};
*/
// ==============================================================
// ==============================================================
// ==============================================================
volatile uint16_t gW = 0;
volatile uint16_t gY = 0;
volatile uint16_t multiADC[2];

volatile int16_t P_now, W_now;

volatile float  KP_INIT  =	1;
volatile float  KI_INIT, \
                KD_INIT, \
                TF_INIT = 0;



//float W_INT_BUFF[33]= { 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,0 };

//float *TEMP_WANT2 = W_INT_BUFF;	/* position we want to have */
//volatile uint32_t ct = 20000;

volatile float setpoint_tgl = (1.25-0.4);

/*
 * function pointer */

//int (*f2) (float);

//int func14(float fp1, float fp2) {
//    printf("func14dir1: %f func14dir2: %f\n", fp1,fp2);//     %f\n",*fp,  *(fp+1));
//    return 14;//updateActuator_f(*fp, *(fp+1)); 
//}


// ==============================================================
//     IRQ callback:    Timer 5 overrun     Heartbeat timer
// ==============================================================
//void TIM5_IRQHandler(void) {
//    if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET) {
//		TIM_ClearITPendingBit(TIM5, TIM_IT_Update);
//        
//    }
//}
// ==============================================================
//     IRQ callback:    Timer 4 overrun     Waveform Generator    
// ==============================================================
#define NO1 1
#ifdef NO1
void TIM4_IRQHandler(void) {
    if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM4, TIM_IT_Update);

        if (ass.tripped) {
            MDB_GPIO_Toggle(BEAM_INTERRUPT);
        }
        
        /* Check which waveform mode is active */
        if (g.waveForm == SQUAREWAV) {
            if (*pSeq_f == '\0') {
                pSeq_f = &squarewaveBuff[0];
                pInt = &interrupterBuff[0];
                MDB_GPIO_Toggle(TRIGGER_SRC);
            }
            setpoint_tgl = (float)*pSeq_f++ * g.ampl_f;
            beamCtrl(BEAM_CTRL_SOURCE_MANUAL, (*pInt++) ? GPIO_ON : GPIO_OFF );
            return;
        }
        
