mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
        if (g.waveForm == TRIANG) {
            if (setpoint_tgl  <= triStruct.top) {
                setpoint_tgl += triStruct.derivate;
            }
            else {
                setpoint_tgl = triStruct.bottom;
            }
        }
    }
}
#else
void TIM4_IRQHandler(void) {
fff
volatile float ft=0;

    if (TIM_GetITStatus(TIM4, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
        
        /* Check which waveform mode is active */
        if (g.waveForm == SQUAREWAV) {
            if (vectorCtr >= NVECTORS) {
                vectorCtr = 0;
            }
            setpoint_tgl = (float)line1[vectorCtr][1] * g.ampl_f;
            if (line1[vectorCtr++][0] == 0) 
                beamCtrl(BEAM_CTRL_SOURCE_MANUAL, GPIO_OFF );
            else
                beamCtrl(BEAM_CTRL_SOURCE_MANUAL, GPIO_ON );

        }
    }
}
#endif
// ==============================================================
//    IRQ callback:    DMA2_Stream0 transmission-complete
// ==============================================================
//     PID: This callback initiates compensator calculation 
// ==============================================================
void DMA2_Stream0_IRQHandler(void) {
    /**< Since this is the only irq flag for this handler, clear direct. */
    DMA_ClearITPendingBit(DMA2_Stream0, DMA_IT_TC);
    DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, DISABLE);

/*    
    if (ct >= 5) {
        ct--;
    }
    else {
        ct = 100000;
        if (setpoint_tgl >= (float)1.25) {
            setpoint_tgl = (float)(1.25-0.05);
        }
        else {
            setpoint_tgl = (float)(1.25+0.05);
        }
    }
*/

/**< Das analoge symmetrische Positionssignal muss vor der AD- Wandlung einen positiven 
 * Offset erhalten wegen des Eingangsspannungsbereichs der intergrierten ADC-Zellen.
 * Analog wird also das sym. Pos. Signal um AREF/2 nach oben geschoben.
 * Hier wird der Offset digital wieder abgezogen damit auch Regler-Intern mit symmetrischen 
 * Sequenzen gearbeitet werden kann. 
 * 
 * ==>  Fuer die DAC-Hardware gilt das Gleiche, der +Offset (von vor ADC) wird also nach dem 
 *      DA-Wandler analog wieder subtrahiert. Darum muss dem intern symmetrischen Signal
 *      vor dem beschreiben des DAC-Data-hold-registers wieder AREF/2 aufaddiert werden.
 */
 
/**< 
* Take a copy of direct-memory-accessed array ADC_MultiConvBuff 
* Up to this point, the access macros SETPOINT_Y_FLOAT, POS_Y_FLOAT ... 
* also holds the new values 
*/
    for (__IO uint8_t k=0; k<4; k++) {
        ADC_fBuff[k] = (float) ((float) (ADC_MultiConvBuff[k] - AN_OFFSET) * LSB);     
    }

// ==============================================================
//            Laser interrupter control
// ==============================================================
/* To implement the functionality of blanking a setpoint vector, 
 * simply add a blanking information column to the setpoint 
 * datastream
 *
 * [x-coordinate; y-coordinate; blankingBit] 
 */

// ==============================================================
//            Setpoint source selector
// ==============================================================
    while (1) {
        if (g.setpointSrc == INTERNAL_SETPOINT) {   ///< Internal only, no remote offset or something else 
            pidErr_x =  setpoint_tgl - POS_X_FLOAT;              
            pidErr_y =  setpoint_tgl - POS_Y_FLOAT;              
        }
        if (g.setpointSrc == ANALOG_SETPOINT) {     ///< setpoint is sourced by analog input 
                // flot conversion!
        }
        if (g.setpointSrc == REMOTE_SETPOINT) {     ///< Remote only, no internal signal or offset 
            pidErr_x =  pidDataX.W_remf - POS_X_FLOAT;              
            pidErr_y =  pidDataY.W_remf - POS_Y_FLOAT;              
        }
        if (g.setpointSrc == REMOTE_OPENLOOP) {     ///< PID bypassed, remote setpoint feed throgh 
            updateActuator_f( /*pidDataY.W_remf*/ \
                                pidDataY.W_remf, pidDataY.W_remf);
            break;
        }
        if (g.setpointSrc == REMOTE_INTERNAL_MIXED) {     ///< Mixed mode, summing internal + external setpoint 
            pidErr_x = ((float)(setpoint_tgl + pidDataX.W_remf)) - POS_X_FLOAT;
            pidErr_y = ((float)(setpoint_tgl + pidDataY.W_remf)) - POS_Y_FLOAT;
        }
        if (  (g.setpointSrc != INTERNAL_SETPOINT) && (g.setpointSrc != ANALOG_SETPOINT)  && \
              (g.setpointSrc != REMOTE_OPENLOOP)   && (g.setpointSrc == REMOTE_OPENLOOP) ) {
             /* Error state, halt */
             TM_DISCO_LedOn(LED_GREEN);
             TM_DISCO_LedOn(LED_RED);
        }
        
        /**< Calculate PID here */
//        ////dbg(DBG_PID_TIMING_PE6, hi);
//        updateActuator_f(   arm_pid_f32(&PIDY, pidErr_y), \
//                            arm_pid_f32(&PIDY, pidErr_y));
//        ////dbg(DBG_PID_TIMING_PE6, lo);

        
        break;
    }    
   
   

    /* Set LEDs according to which angular position is greater */
//    if ( POS_Y_FLOAT > SETPOINT_Y_FLOAT) {
//        TM_DISCO_LedOn(LED_GREEN);
//        TM_DISCO_LedOff(LED_RED);
//    } else if ( POS_Y_FLOAT <  SETPOINT_Y_FLOAT) {
//        TM_DISCO_LedOn(LED_RED);
//        TM_DISCO_LedOff(LED_GREEN);
//    } else {
//        TM_DISCO_LedOff(LED_ALL);
//    }
   
}

// ==============================================================
//     IRQ callback:    ADC end-of-conversion 
// ==============================================================
void ADC_IRQHandler(void) {
    if (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == SET) {
        ADC_ClearITPendingBit(ADC1, ADC_IT_EOC);
        /* End of conversion interrupt occured */
        ////dbg(DBG0, lo);
        uint16_t W_now = ADC_MultiConvBuff[1];   // setpoint (Isens_y)
        return;
    }
    
   
    if (ADC_GetFlagStatus(ADC1, ADC_FLAG_AWD) == SET) {
        ADC_ClearITPendingBit(ADC1, ADC_IT_AWD);
        if ((ass.state == ASS_STATIONARY_INTEGRATOR) ||
            (ass.state == ASS_DISCHARGING_INTEGRATOR)) {
            ass.state = ASS_CHARGING_INTEGRATOR;
            printf("ASS:charging_start...\n");
        }
    /* Analog watchdog interrupt occured */
        if ((ass.integrator <= ass.lowerVal) || (ass.integrator >= ass.upperVal)) {   /**< check for integrator limit */
            if (! ass.tripped) {
                ass.tripped = 1;                    /**< Set "tripped" state if it is so */
                DAC_SecureSetDualChanSigned = \
                      &DAC_SetDualChanSigned_Tripped;  /**< set function pointer to the "ass tripped" handler*/
            }
            return;
        }
        else {                                  /**< else increment integrator */
            ass.integrator+= ass.upperVal * (double)TS_US*1e-6/(ass.tripTime);
        }
        return;
    }
    printf("bad ADC IntReq source\n");
}
	
// ==============================================================
//     IRQ callback:    Timer 2 overrun 
// ==============================================================
void TIM2_IRQHandler(void) {
	////dbgT(DBG2);
//	GPIO_ToggleBits(DBG_IO, DBG4);
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

        ////dbg(DBG4, lo);
        DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, ENABLE);
        
//        if (ass.stateCtr >= (uint8_t)(ASS_100US / TS)) {
//            ass.stateCtr = 0;
//            if (ass.integrator > 0) {
//                ass.state = ASS_DISCHARGING_INTEGRATOR;
//                ass.tripped = 0;
//                ass.integrator -= ass.upperVal * (double)TS*1e-6/(ass.tripTime);
//            }
//        }
	}
    else
        while (1);;
}





/* ---------- */
/* Used Timer */
/* ---------- */
// (4)  TM_Timer4_config(ENABLE, ENABLE, 450 / g.freq);         waveformGeneration
// (3)  TM_PWM_InitTimer(TIM3, &TIM_Data, 1000);
// (2)  TM_Timer2_config(DISABLE, ENABLE, SAMPLE_INTERVAL);     Base sample rate
//


/**
  * @brief  This function decrement timing variable
  *	@with __weak parameter to prevent errors
  * @param  None
  * @retval None
  */
__weak void TimingDelay_Decrement(void) {

