mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
}


// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//        IMPORT from MATLAB code generated project pid_lib_v3
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#pragma O0
// ==============================================================
//     IRQ callback:    SysTick Interrupt
// ==============================================================
void SysTick_Handler(void)
{
    uint16_t ypid_uint=0;
    int16_t ypid_int=0;

    
    TimingDelay_Decrement();
    
    ////dbgT(DBG_PID_TIMING_PE6);
    MDB_GPIO_Toggle(DBG_TIMING_PE2);

    /* Manage nb of loop before interrupt has to be processed */
    remainAutoReloadTimerLoopVal_S--;
    if (remainAutoReloadTimerLoopVal_S) {
        MDB_GPIO_Toggle(DBG_TIMING_PE4);
        return;
    }

    remainAutoReloadTimerLoopVal_S = autoReloadTimerLoopVal_S;

    /* Check base rate for overrun */
    if (OverrunFlags[0]) {
        rtmSetErrorStatus(pid_lib_v3_M, "Overrun");
        TM_DISCO_LedOn(LED_RED);
        return;
    }

    OverrunFlags[0] = TRUE;

    /* Step the model for base rate */
MDB_GPIO_Toggle(DBG_TIMING_PE6); 
    pid_lib_v3_step();
MDB_GPIO_Toggle(DBG_TIMING_PE6); 
   
    /* Get model outputs here */
    ypid_int = decodeDbl_toInt( pid_lib_v3_Y.Ypid );
    ypid_uint = ypid_int + AN_OFFSET;
    DAC_SetDualChanSigned( ypid_uint, ypid_uint );
    
    /* Indicate task for base rate complete */
    OverrunFlags[0] = FALSE;
}
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//    END of    IMPORT from MATLAB code generated project pid_lib_v3
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
double lastVal=0;

int main(void) {
   /**< Define private main variables */
    TM_PWM_TIM_t TIM_Data;    ///< Timer data for PWM 
    volatile uint8_t c = 0;
    volatile uint16_t rxval = 0;
    volatile uint16_t test = 0;




   /**< Initialize System, Delay library and GPIOs */
    SystemInit();       /**< Initialize system. */
    TM_DELAY_Init();    /**< Initialize Delay library. */

    /* ==============================================================
              Enable SYSCLK routing to MCO2 (PC9)
    ============================================================== */
//    gpio_init_mco1();
//    RCC_MCO1Config(RCC_MCO1Source_HSE,RCC_MCO1Div_1);
//    gpio_init();
//    
    
    MDB_GPIO_Init();    ///< Init interrupter GPIOs


   /**< Initialize autoShutdown system struct. */
    ass.lowerVal = ASS_TRIPPING_LOWER_DEFAULT;
    ass.upperVal = ASS_TRIPPING_UPPER_DEFAULT;
    ass.lowerVal = -1.25;
    ass.upperVal = 1.25;
    
    ass.integrator = 0;
    ass.safeVal = ASS_SAFEVALUE_DEFAULT ;
    ass.tripped = 0;
    ass.ack = 0;
    ass.tripTime = ASS_TRIPPING_TIME_DEFAULT; // 750ms initial
    ass.state = ASS_STATIONARY_INTEGRATOR;
    ass.stateCtr = 0;
    
   /**< Initialize global structure */
    g.waveForm = NN; g.duty = 999; g.freq = 999; g.lookAt = 999;
    g.dacHw[TM_DAC1].upperLim = (int16_t)( 2113 - ADC_RNG/2 );
    g.dacHw[TM_DAC1].lowerLim = (int16_t)( 1917 - ADC_RNG/2 );
    g.dacHw[TM_DAC2].upperLim = (int16_t)( 2113 - ADC_RNG/2 );
    g.dacHw[TM_DAC2].lowerLim = (int16_t)( 1917 - ADC_RNG/2 );
    g.setpointSrc = REMOTE_INTERNAL_MIXED;
    g.refresh = 20;    
    g.beamEnabled = GPIO_ON;
 
   /**< Initialize PID system, float32_t format */
//    arm_pid_init_f32(&PIDX, 1);       @@@NOARMPID
//    arm_pid_init_f32(&PIDY, 1);       @@@NOARMPID

 
   /**< Initialize discovery button and leds */
    TM_DISCO_ButtonInit();

    /* Initialize Leds */
    TM_DISCO_LedInit();

   /**< Initialize USART1-> TX: PA9, RX: PA10. */
    TM_USART_Init(USART1, TM_USART_PinsPack_1, 115200);			

   /**< Initialize TIM3, 1kHz frequency */
    TM_PWM_InitTimer(TIM3, &TIM_Data, 1000);

   /**< Initialize TIM2, Channel 1, PinsPack 2 = PA5 */
    TM_PWM_InitChannel(&TIM_Data, TM_PWM_Channel_3, TM_PWM_PinsPack_2);  // ???? PB0

    /* Set default duty cycle */
    TM_PWM_SetChannelPercent(&TIM_Data, TM_PWM_Channel_3, duty);


   /**< Initialize TIM5, heartbeat timer */
    //TM_Timer5_config(ENABLE, ENABLE, 48000);        // 48MHz*1ms
       
   /**< Initialize DAC outputs DAC1-> PA4  DAC2-> PA5 */
    TM_DAC_Init(TM_DAC1);       
    TM_DAC_Init(TM_DAC2);       

    printf("connect Write pointer to DAC output register\n");
    DAC_SecureSetDualChanSigned = &DAC_SetDualChanSigned;    
    
   /**< Initialize TIM2 as part of sampling hardware */
    TM_Timer2_config(DISABLE, ENABLE, SAMPLE_INTERVAL);
    ADC_ContScanMode_w_DMA_timeTrigd( ADC_MultiConvBuff, 4);

   /**< Set PID parameters */
    PIDX.Kp = PID_PARAM_KP;		/* Proporcional */
    PIDX.Ki = PID_PARAM_KI;		/* Integral */
    PIDX.Kd = PID_PARAM_KD;		/* Derivative */
    PIDY.Kp = PID_PARAM_KP;		/* Proporcional */
    PIDY.Ki = PID_PARAM_KI;		/* Integral */
    PIDY.Kd = PID_PARAM_KD;		/* Derivative */

   /**< Set threshold for analog watchdog */
    ADC_AnalogWatchdogThresholdsConfig(ADC1,    
                                decode_toUint(ass.upperVal + AREF_BY2), 
                                decode_toUint(ass.lowerVal + AREF_BY2));

   /**< Transmitt bootup message to UART1 */
    char *tok;
    char *delimit = "\\";
    tok = strtok(__FILE__, delimit);
    tok = strtok (NULL, delimit);

    printf("\n\n--- %s ---\n", tok);
    printf("--- Compiled: %s  %s ---\n\n", __DATE__, __TIME__);
    printf("__TARGET_ARCH_ARM: %s\n", TARGET_ARCH_ARM[__TARGET_ARCH_ARM]);
    printf("__BASE_FILE__: %s\n", __BASE_FILE__);


/* ================================================================================ */       
/**< ===============     ENABLE_ON_POWER-ON-SEQUENCE     ======================================== */       
/* ================================================================================ */       

	TIM_Cmd(TIM3, ENABLE);          ///< Enable PWM timer 3
    TIM_Cmd(TIM2, ENABLE);          ///< Enable sampling timer 2
    ADC_DMACmd(ADC1, ENABLE);       ///< Enable DMA functionality
    ADC_Cmd(ADC1, ENABLE);          ///< Enable onboard hardware ADC 1
    ADC_SoftwareStartConv(ADC1);    ///< Trigger the regular group scan 

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//        IMPORT from MATLAB code generated project pid_lib_v3
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

    /* Data initialization */
    int_T i;
    for (i = 0; i < 1; i++) {
        OverrunFlags[i] = 0;
    }

    /* Clock has to be configured first*/
    // RCC_Configuration();

