mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
    /* Model initialization call */
    pid_lib_v3_initialize();


    /* Systick configuration and enable SysTickHandler interrupt */
    if (SysTick_Config((uint32_t)(SystemCoreClock * TS))) {
        autoReloadTimerLoopVal_S = 1;
        do {
            autoReloadTimerLoopVal_S++;
        } while ((uint32_t)(SystemCoreClock * TS) / autoReloadTimerLoopVal_S >
                 SysTick_LOAD_RELOAD_Msk);

        SysTick_Config((uint32_t)(SystemCoreClock * TS) / autoReloadTimerLoopVal_S);
    }

    remainAutoReloadTimerLoopVal_S = autoReloadTimerLoopVal_S;//Set nb of loop to do

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//    END of    IMPORT from MATLAB code generated project pid_lib_v3
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    TM_DISCO_LedOn(LED_GREEN);
    TM_DISCO_LedOn(LED_RED);
    TM_DISCO_LedOff(LED_GREEN);
    TM_DISCO_LedOff(LED_RED);
    
  /* Infinite loop */
  /* Real time from systickHandler */
    while (1) {
        while (! TM_DISCO_ButtonOnPressed()) {};
        TM_DISCO_LedOn(LED_GREEN);

        while (! TM_DISCO_ButtonOnPressed()) {
//            printf("x: % 1.6f  y: % 1.6f\n", ADC_fBuff[INDEX_Px], ADC_fBuff[INDEX_Py]);
            printf("W: % 3.2f\tPy: % 3.2f\tE: % 3.2f\tDuty: % 3.2f%%\n", \
                                SETPOINT_Y_FLOAT, POS_Y_FLOAT, pidErr_y, toPlant_y); 
            Delayms(100);
        }
         pid_lib_v3_P.pulseGenEN_CurrentSetting = 0x01;
//         TM_DISCO_LedOn(LED_RED);
         printf("pid_lib_v3_P.pulseGenEN_CurrentSetting = 0x01\n");

        while (! TM_DISCO_ButtonOnPressed()) {
        }
    }   
    /**< Main loop */

	while (1) {
/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */    
/*                      fast Console                               */
/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */ 
        while (! TM_DISCO_ButtonOnPressed()) {
            //Console(&pidDataY, &fpidData, _INT_);    
            fastConsoleCase(&PIDY);     
            
            for (uint8_t k=0; k < 20; k++) {
                if (TM_USART_BufferFull(USART1)) {
                    printf( MSG_GUI_UART1_RECV_BUFF_FULL );
                    fastConsoleCase(&PIDY); 
                    TM_USART_ClearBuffer(USART1);
                };
                Delayms((uint32_t)g.refresh/20);
            }
//            if ((ass.state == ASS_CHARGING_INTEGRATOR) && (! ass.tripped)) {
            if (ass.integrator != lastVal) {
                printf("%.8f\n", ass.integrator);
            }
            if ((ass.tripped) && (! ass.ack)) {
                printf("Tripped!");
                ass.ack = 1;
                lastVal = ass.integrator;
                TM_Timer4_config(ENABLE, ENABLE, 45000 / 3);
            }
            
        }



/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */    
/*              fast Console / REMOTE_OPENLOOP                     */
/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */ 
        while (! TM_DISCO_ButtonOnPressed()) {
            fastConsoleCase(&PIDY);            
            g.setpointSrc = REMOTE_OPENLOOP;

            for (uint8_t k=0; k < 20; k++) {
                if (TM_USART_BufferFull(USART1)) {
                    printf( MSG_GUI_UART1_RECV_BUFF_FULL );
                    fastConsoleCase(&PIDY); 
                    TM_USART_ClearBuffer(USART1);
                };
                Delayms((uint32_t)g.refresh/20);
            }     

            printf("W: % 3.2f\tPy: % 3.2f\tE: % 3.2f\tDuty: % 3.2f%%\n", \
                SETPOINT_Y_FLOAT, POS_Y_FLOAT, pidErr_y, toPlant_y);                        
        }
/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */    
/*              fast Console / W:  P:  Duty:                       */
/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */   
        while (! TM_DISCO_ButtonOnPressed()) {
            //Console(&pidDataY, &fpidData, _INT_);    
            fastConsoleCase(&PIDY);            

            for (uint8_t k=0; k < 20; k++) {
                if (TM_USART_BufferFull(USART1)) {
                    printf( MSG_GUI_UART1_RECV_BUFF_FULL );
                    fastConsoleCase(&PIDY); 
                    TM_USART_ClearBuffer(USART1);
                };
                Delayms((uint32_t)g.refresh/20);
            }     

            printf("W: % 3.2f\tPy: % 3.2f\tE: % 3.2f\tDuty: % 3.2f%%\n", \
                SETPOINT_Y_FLOAT, POS_Y_FLOAT, pidErr_y, toPlant_y);                        
        }
        

/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */    
/*              fast Console / W:  P:  Duty:                       */
/* ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::: */     
        while (! TM_DISCO_ButtonOnPressed()) {
            //Console(&pidDataY, &fpidData, _INT_);    
            fastConsoleCase(&PIDY);            

            for (uint8_t k=0; k < 20; k++) {
                if (TM_USART_BufferFull(USART1)) {
                    printf( MSG_GUI_UART1_RECV_BUFF_FULL );
                    fastConsoleCase(&PIDY); 
                    TM_USART_ClearBuffer(USART1);
                };
                Delayms((uint32_t)g.refresh/20);
            }     

            printf("W: % 3.2f\tPy: % 3.2f\tE: % 3.2f\tDuty: % 3.2f%%\n", \
                SETPOINT_Y_FLOAT, POS_Y_FLOAT, pidErr_y, toPlant_y);                        
        }
    }
}
/*	
	while (1) {
        / * Read temperature 1, reference temperature * /
//        TM_DS18B20_Read(&OneWire, device[0], &SETPOINT_Y_FLOAT);
        

        / * Format string * /
        printf("W: % 3.2f\tPy: % 3.2f\tE: % 3.2f\tDuty: % 3.2f%%\n", \
            SETPOINT_Y_FLOAT, POS_Y_FLOAT, pidErr_y, toPlant_y);
        Delayms(g.refresh);
    }
    */
 /* End of main function */

/** 
 * @brief   Set beam control source and new state
 */ 
int beamCtrl(beamCtrlSource_t src, MDB_GPIO_STATE_t newState ) {
    if ((src == BEAM_CTRL_SOURCE_GLOBAL) && (newState != DNI)) {
        printf("Error, Beam source can't be GLOBAL if new state is not DNI");
        return -1;
    }

    if ((src == BEAM_CTRL_SOURCE_GLOBAL) && (newState == DNI)) {
        MDB_GPIO_Switch(BEAM_INTERRUPT, g.beamEnabled);
        return 0;
    }

    if (src == BEAM_CTRL_SOURCE_MANUAL) {
        MDB_GPIO_Switch(BEAM_INTERRUPT, newState);
        return 0;
    }
    
    return -1;
}



/**
 * @brief   Safely update actuator control signals
 * Safely means in terms of missplaced or oscillating controller outputs.
 * The analog watchdog peripheral takes care about "out of normal range" 
 * events. If a converted position signal is out of range, the watchdog 
 * handler starts time integration and after "out of range" integrator 
 * reaches a defineable limit, the watchdog takes the system to into
 * "Tripped" state.
 * Therefor a global error flag becomes true AND the function pointer
 * DAC_SetDualChanSigned() that points to a wraper function, gots to be
 * replaced by a pointer that points to DAC_SetDualChanSigned_Tripped().
 * In the DAC_SetDualChanSigned() function, that is pointed to in tripped 
 * state, only outputs a zero level DAC-Signal to take external hardware 
 * in a safe state.
 */
int updateActuator_f(float I_set_x, float I_set_y) {
    int toPlant_intBuff[2] = { 0, 0 };
    int *toPlant_int = &toPlant_intBuff[0];
    
