mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
    if (!ass.tripped) {     ///< only if ass state is NOT tripped

        /**< decode the float values to an integral type */
        *toPlant_int     = decode_toInt(I_set_x);
        *(toPlant_int+1) = decode_toInt(I_set_y);

        /**
         * Check decoded values to be in DAC output range. Clipping 
         * would be necessary 
         */
        for (uint8_t k=0; k<2; k++) {
            if (*(toPlant_int+k) > UPPER_DAC_LIMIT_SIGNED)
                    *(toPlant_int+k) = UPPER_DAC_LIMIT_SIGNED;
            if (*(toPlant_int+k) < LOWER_DAC_LIMIT_SIGNED)
                    *(toPlant_int+k) = LOWER_DAC_LIMIT_SIGNED;
        }
    } 
    else{   
    /**<><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>    
       <>  This branch eror-handles an ass integrator_full event i.e.<>
       <><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>    
       <>                    FUSE TRIPPED                            <>
       <><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<> */  
       /* All safety related actions are done by the watchdog handler */ 
    }

   /**
    * @brief    Return argument toPlant_int is of type int16_t because 
    *           it holds the --un--biased DAC output register values...
    *           This is a function pointer!
    * Casting from (float32_t) toPlant to int16_t type introduces 
    * rounding errors which couldn't be prevented! 
    */
    DAC_SecureSetDualChanSigned( *toPlant_int, *(toPlant_int+1));  
        
    return 0;
}


/*
 *       @,!,# are newline indicators or line separators
 *
 *       @kp   :=   58
 *       #sin  :=   F F F F  d  d  A  A   A   A
 *       @w:   :=   0.0005452
 *     |______|____|________________|  
 *     |  NC  | FS |      NV        |  
 *     
 *        3      2          16          
 *
 *  => UART_BUFF_SIZE = 23 (newline + 21 + \0)
 *
 */


/*! \brief Fast console command parser
 *
 * Interface to a flat implemented signal generator based on lookup tables
 * Implemented waveforms:
 *
 * Sin/Cos:			Measurements 
 *
 */

#define IDX_CMD     1       // index 0 is @ or ! or #
#define IDX_VAL     5   // index 5 

#define UART_BUFF_SIZE      (1+NC+FS+NV+1)
#define VALUE_BUFF_SIZE     (NV+1)
#define CMD_BUFF_SIZE       (NC+1)

//void fastConsoleCase (volatile struct PID_DATA *pid) {
#pragma O0
void fastConsoleCase (arm_pid_instance_f32 *pid) {
   /**< private member declarations */
	char sUart[UART_BUFF_SIZE],		///< string buffer to hold received input string
		 sCmd[CMD_BUFF_SIZE],		///< string buffer to hold selected command as substring
         sVal[VALUE_BUFF_SIZE];     ///< string buffer to hold given value as substring
    /**< 
     * sVal holds the string representation of a received float value.
     * For useing atof() , a buffer of 4xsizeof(int8_t)+1 [--> float32_t] or 8xsizeof(int8_t) [--> double]
     * is necessary
     */

	char *pCmd = sCmd;		        ///< pointer for buffer arrays
	char *pVal = sVal;		        ///< pointer for buffer arrays
    
    enum cmd_items cmd;
    enum wav_items wav;
    struct items *choice = NULL;
    struct itemsw *choicew = NULL;

	int i;

    volatile uint8_t nChars = TM_USART_Gets( USART1, &sUart[0], UART_BUFF_SIZE);

   /**< Check for serial data frames >= UART_BUFF_SIZE */
	if (nChars < UART_BUFF_SIZE) {
        memset(&sUart, 0, UART_BUFF_SIZE*sizeof(char));    ///< malloc the receive buffer
        return;
    }
  
   /**< malloc() if a frame received where sizeoff() >= UART_BUFF_SIZE */
    memset(&sCmd,0, CMD_BUFF_SIZE*sizeof(char));     ///< malloc command buffer
    memset(&sVal,0, VALUE_BUFF_SIZE*sizeof(char));      ///< malloc value buffer

   /**< Check leading character via receive buffer 
     *      @   frame indicator for pid related config/param.
     *      !   frame indicator for a misc command 
     *      #   frame indicator for a signal generator command 
     */
	if ( sUart[0] == '@') {
    /* pid related config/param */
		strncpy( pCmd, &sUart[IDX_CMD], NC);		///< command substring 
		strncpy( pVal, &sUart[IDX_VAL], NV);		///< Value substring

        /* Check for end of char coded float representation 
         * numeric char:            0...9
         * decimal delimiter:       . or ,  !!!Take caution for forbidden thousands separator!!! 
         * exponental indicator:    e or E
         * signdness:               -
         */
		for (uint8_t k=0; k <= NV; k++) {                   ///< Max NC numbers ... 
            if ( ((*pVal >= '0') && (*pVal <= '9')) || \
                  (*pVal == '.') || (*pVal == ',')  || \
                  (*pVal == 'e') || (*pVal == 'E') || \
                  (*pVal == '-') ) {    
                pVal++;
            }
            else {
                break;
            }
		}
		
		*pVal='\0';	                ///< place EOF marker
        pVal = &sVal[0];

        while ( *pCmd != '=' ) {    ///< check for end of command  indicator '='
			pCmd++;
		}		
		*(pCmd-1)='\0';		        ///< place EOS marker									
        pCmd = &sCmd[0];

        /* parse sCmd buffer and enumerate the command/error */
		for(i = 0, choice = NULL; i < sizeof items_list/sizeof (struct items); i++) {
			if (strcasecmp(sCmd, items_list[i].name) == 0)
			{
				choice = items_list + i;
				break;
			}
		}    

		cmd = choice ? choice->id : UNKNOWN;

        char sValtemp1[] = {"-0.7e-09"};
        volatile float fl1 = atof(&sValtemp1[0]);

#ifdef  FLOAT_PARAMETERS
//            volatile float valueDecoded = (float)tmp/SLIDER_VAL_DEVIDER;
            volatile float valueDecoded = atof( pVal );

#elif   DOUBLE_PARAMETERS
            double valueDecoded = (double)tmp/SLIDER_VAL_DEVIDER;
#else 
        error "datatype?"
#endif

		switch(cmd) {
			case KP:	{   
                            pid->Kp = valueDecoded;
//                            arm_pid_init_f32(&PIDY, 0);   @@@NOARMPID
                            printf("Kp % f set!\n", valueDecoded);
                        }	
                        break;

			case KI:	{
                            pid->Ki = valueDecoded;
//                            arm_pid_init_f32(&PIDY, 0);   @@@NOARMPID
                            printf("Ki % f set!\n", valueDecoded);
//                            printf("Ki %s given\n", &sval[0]);
                        }	
                        break;

