mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
			case KD:	{
                            pid->Kd = valueDecoded;
//                            arm_pid_init_f32(&PIDY, 0);   @@@NOARMPID
                            printf("Kd % f set!\n", valueDecoded);
   //                         printf("Kd %s given\n", &sval);
                        }	
                        break;

			case W:		{
                            pidDataX.W_remf = valueDecoded;
                            pidDataY.W_remf = valueDecoded;
                            pidDataY.remoteCmdActive = 1;
                            printf("W = % g\n", pidDataY.W_remf);
                        }
                        break;

			default:
						printf("unknown choice\n");
			break;
		}
        
        
	}
	else { 	
        /** A trailing ! char in a new Rx frame indicates that a misc command
         * follows...
         */
        if (sUart[0] == '#') {   ///< True if signal generator command received

/** 
 * Trailing # indicates a command frame for signal generation
 *
 * Frame Layout: 
 * 	c		waveform
 * 	v		freq
 * 	d 	dutycycle
 *
 * # c c c : = v v v v  d  d 
 * 0 1 2 3 4 5 6 7 8 9 10  11 12 
 *
 *
 *
 * ------ Aus Qt software v8.3 
 * Frame Layout:
 * cwaveform
 * vfreq
 * d dutycycle
 *
 * # c c c : = F F F F  d  d  A  A   A   A
 * 0 1 2 3 4 5 6 7 8 9 10  11 12 13  14  15     
 *
 * Amplitude als char coded float
 *
 * # c c c : = F F F F  d  d  A ..16x.. A 
 * 0 1 2 3 4 5 6 7 8 9 10  11 12 13  14  .... 27     
 *
 */
     
    //char 	sWav[NC+1],		///< string buffer to hold selected waveform as substring
    //        sFreq[NV+1],	///< string buffer to hold given frequency as substring
    //        sDuty[ND+1];	///< string buffer to hold given duty cycle as substring

            uint8_t NC = 3;		// index 0...3
    //		uint8_t FS = 2;		// index 4...5	(fieldsep)
            uint8_t NV = 4;		// index 6...9
            uint8_t ND = 2;		// index 10...11
            uint8_t NA = 16;		// index 12...15

            char 	sWav[NC+1],		///< string buffer to hold selected waveform as substring
                    sFreq[NV+1],	///< string buffer to hold given frequency as substring
                    sDuty[ND+1],	///< string buffer to hold given duty cycle as substring
                    sAmp[16];	    ///< string buffer to hold given amplitude as substring

//            char *pWav = sWav;
            char *pDuty = sDuty;
            char *pFreq = sFreq;
            char *pAmp = sAmp;
            
            strncpy(sWav,  &sUart[1], NC);	///< waveform substring 
            strncpy(sFreq, &sUart[6],  4);		///< frequency substring
            strncpy(sDuty, &sUart[10], 2);		///< duty cycle substring
            strncpy(sAmp, &sUart[12], 16);		///< peak amplitude substring


        /* Check for end of char coded float representation 
         * numeric char:            0...9
         * decimal delimiter:       . or ,  !!!Take caution for forbidden thousands separator!!! 
         * exponental indicator:    e or E
         * signdness:               -
         */
        for (uint8_t k=0; k<NC; k++) {  ///< check for end of command  indicator '='
            if( *pCmd == RX_FRAME_PADDING_CHAR )        
                break;
			pCmd++;
		}		
		*(pCmd-1)='\0';		 ///< place EOS marker									
        pCmd = &sCmd[0];

        for (uint8_t k=0; k<NV; k++) {  ///< check for end of command  indicator '='
            if( *pFreq == RX_FRAME_PADDING_CHAR )        
                break;
			pFreq++;
		}		
		*pFreq='\0';		 ///< place EOS marker									
        pFreq = &sFreq[0];

       for (uint8_t k=0; k<ND; k++) {  ///< check for end of command  indicator '='
            if( *pDuty == RX_FRAME_PADDING_CHAR )        
                break;
			pDuty++;
		}		
		*pDuty='\0';		 ///< place EOS marker									
        pDuty = &sDuty[0];

		for (uint8_t k=0; k <= NA; k++) {                   ///< Max NC numbers ... 
            if ( ((*pAmp >= '0') && (*pAmp <= '9')) || \
                  (*pAmp == '.') || (*pAmp == ',')  || \
                  (*pAmp == 'e') || (*pAmp == 'E') || \
                  (*pAmp == '-') ) {    
                pAmp++;
            }
            else {
                break;
            }
		}
		*pAmp='\0';	    ///< place EOF marker
        pAmp = &sWav[0];


    /* parse sCmd buffer and enumerate the command/error */
        for(i = 0, choicew = NULL; i < sizeof itemsw_list/sizeof (struct itemsw); i++)
        {
            if (strcasecmp(sWav, itemsw_list[i].name) == 0)
            {
                choicew = itemsw_list + i;
                break;
            }
        }   

		wav = choicew ? choicew->idw : NN;
//    /**	
//     * Check for invalied chars in command string
//     *	Only [a-zA-Z] is threated as part of command string
//     *
//     */
//            while ( (*pWav >= 0x41) && (*pWav <= 0x5A) || 
//                            (*pWav >= 0x61) && (*pWav <= 0x7A) ) {	
//                pWav++;
//            }		

//    /**
//     * Same item structure used for PID-param and 
//     * waveform generation commands! Don't forget 
//     * to offset the for loop while while read in 
//     * a waveform command.
//     *
//     */				
//            for(i = 0, choicew = NULL; i < sizeof itemsw_list/sizeof (struct itemsw); i++)
//            {
//                if (strcasecmp(sWav, itemsw_list[i].name) == 0)
//                {
//                    choicew = itemsw_list + i;
//                    break;
//                }
//            }    

//            wav = choicew ? choicew->idw : NN;
        volatile float valueDecoded = atof( pVal );

            g.waveForm 	= wav;
            g.freq		= atoi(sFreq);
            g.duty 		= atoi(sDuty);
            g.ampl_f 	= (float)atof(sAmp);
            g.ampl      = (int) g.ampl_f * 1000;
            
            //g.ampl_f = (float)g.ampl / (float)AMPL_FLOAT_DIVISOR;
            
            if (g.ampl_f > (float)AREF_IN_VOLT/2)
                g.ampl_f = (float)AREF_IN_VOLT/2;
            if (g.ampl_f < -(float)AREF_IN_VOLT/2)
                g.ampl_f = -(float)AREF_IN_VOLT/2;
//            g.ampl_f = (float)g.ampl / (float)AMPL_FLOAT_DIVISOR;
//            
//            if (g.ampl_f > (float)AREF_IN_VOLT/2)
//                g.ampl_f = (float)AREF_IN_VOLT/2;
//            if (g.ampl_f < -(float)AREF_IN_VOLT/2)
//                g.ampl_f = -(float)AREF_IN_VOLT/2;
            
    /**
     *	Calculate the interval for lookup table index increment 
     *	based on @SAMPLE_INTERVAL / TS, sizeof table and given 
     *  waveform frequency.
     *	
     *	g.freq  	[Hz] 	
     *	TS_US			[us]	* 10^(-6)	
     *
     *  g.lookAt = g.freq/(TABLESIZE * TS_US * 10^(-6))
     *           = g.freq * 10^4 / TS_US        
     */


    //        g.lookAt = (short) 1/((double)TABLESIZE * TS_US * 10^(-6));
    //		g.lookAt = (uint32_t) g.freq * pow(10,6) / (TABLESIZE * TS_US);
    //        printf(" g.lookAt: %i", g.lookAt);

    //        g.lookAt = g.lookAt / 100;
    //        printf(" g.lookAt/100: %i", g.lookAt);
            g.tctr = g.lookAt;

    /**
     *  Precalculate a lookup table based on normed array
     *
     */
            for (uint16_t k=0; k<TABLESIZE; k++) {
              calcTab[k] = (uint16_t) g.ampl * CosineN[k];  
            };
            
            switch(wav) {
                    case COS:			{
                                            printf("Cosine \n");
                                            pSeq = &Cosine[0];
                                            g.pBase = pSeq;
                                            g.gen = EN;
                    }	
                    break;

