mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
                    case TRIANG:		{
                                            printf("Triangle \n");
    //										pSeq = &Triangle[0];
                                            /* 450/g.freq --> 100 Timer Ovf / periode */
                                            triStruct.bottom = ((float)AREF_BY2 - g.ampl_f / 2);
                                            triStruct.top = ((float)AREF_BY2 + g.ampl_f / 2);
                                            triStruct.derivate = g.ampl_f / (float)100;
//                                            g.pBase = pSeq;
                                            g.waveForm = TRIANG;
                                            triStruct.triCtr = 0;
                                            TM_Timer4_config(ENABLE, ENABLE, 450 / g.freq);
                                            g.gen = EN;
                    }	
                    break;

                    case SQUAREWAV:	{
                                            printf("Squarewave\n");
                                            TM_Timer4_config(ENABLE, ENABLE, 45000 / g.freq);
                                            g.setpointSrc = REMOTE_INTERNAL_MIXED;
                                            g.waveForm = SQUAREWAV;
                                            g.gen = EN;
                                            pSeq_f = &squarewaveBuff[0];
                    }	
                    break;

                    case QUADRATIC:	{
                                            printf("Quadratic\n");
                                            pSeq = &Quadratic[0];
                                            g.gen = EN;
                    }	
                    break;
                    
                    case I_QUADRATIC:	{
                                            printf("Inv Quadratic\n");
                                            pSeq = &I_Quadratic[0];
                                            g.gen = EN;
                    }	
                    break;

                    case SAWTOOTH:		{
                                            printf("Sawtooth\n");
                                            pSeq = &Sawtooth[0];
                                            g.gen = EN;
                    }	
                    break;

                    case CMD_REMOTE_SETPOINT: {
                                            printf("CMD_REMOTE_SETPOINT\n");
                                            g.setpointSrc = REMOTE_SETPOINT;
                    }	
                    break;

                    case CMD_OPENLOOP_REMOTE: {
                                            printf("CMD_OPENLOOP_REMOTE\n");
                                            g.setpointSrc = REMOTE_OPENLOOP;
                    }	
                    break;

                    case CMD_ANALOG_SETPOINT: {
                                            printf("CMD_ANALOG_SETPOINT\n");
                                            g.setpointSrc = ANALOG_SETPOINT;
                    }	
                    break;

                    case CMD_INTERNAL_SETPOINT: {
                                            printf("CMD_INTERNAL_SETPOINT\n");
                                            g.setpointSrc = INTERNAL_SETPOINT;
                    }	
                    break;
                    
                    
                    default: {
                                            printf("unknown choice\n");
                                            g.waveForm = NN;
                                            g.duty 	= 999;
                                            g.freq	= 999;
                                            g.lookAt = 999;
                                            g.pBase 	= pSeq;
                                            g.tctr	= 999;
                                            g.gen		= DIS;
                    }
                    
                    /* Disable waveform generation if wgm-off command received */
            }
            
    //		g.pBase = (uint32_t)&pSeq;
            
            
            
        }
        else {                   ///< True if a misc command received
/** 
 * Trailing ! indicates that a misc command frame was received
 *
 * Frame Layout: 
 * 	c	command
 *
 * ! c c c c c c c c c c  c  c 
 * 0 1 2 3 4 5 6 7 8 9 10 11 12 
 *        
 */       
#define MISC_CMD_LENGTH     35  // + trailing !
            enum misc_items misc;
            struct itemsm *choicem = NULL;

            ///< string buffer to hold given command substring
            char sMisc[MISC_CMD_LENGTH + 1]; 
            char *pMisc = sMisc;
            
            strncpy(sMisc, 	&sUart[1],  MISC_CMD_LENGTH);	///< command substring
            
            /**< Check for valied characters and substitute first unvalied char
             * by EOS char
             */

            while ( (*pMisc >= 'A') && (*pMisc <= 'Z') || \
                    (*pMisc >= 'a') && (*pMisc <= 'z') || \
                    (*pMisc >= '0') && (*pMisc <= '9') || \
                    (*pMisc == '-') || (*pMisc == '_') || \
                    (*pMisc == '.') || (*pMisc == ',') || \
                    (*pMisc == 'e') || (*pMisc == 'E') ){	    

                pMisc++;
            }
            
            *pMisc='\0';				///< End of string


            for(i = 0, choicem = NULL; i < sizeof itemsm_list/sizeof (struct itemsm); i++)
            {
                if (strcasecmp(sMisc, itemsm_list[i].name) == 0)
                {
                    choicem = itemsm_list + i;
                    break;
                }
            }    

            misc = choicem ? choicem->idm : misc_NN;
            
            g.miscReq 	= misc;
            
            switch (misc) {
                case misc_assOnOff_cmd:
                    break;                
                case misc_assUpperLim_cmd:     
                    break;                
                case misc_assLowerLim_cmd:     
                    break;                
                case misc_assTrippTime_cmd:     
                    break;                
                case misc_assSaveVal_cmd:     
                    break;                

                case misc_pid_init:     
//                    pid_Init(KP_INIT, KI_INIT, KD_INIT, TF_INIT, TS_US, &pidDataY, NONBUFFERED);
                    resetPID();
                    break;
                case misc_beamOff_cmd:   
                        MDB_GPIO_BeamPin(BEAM_INTERRUPT, GPIO_DRIVER_OFF);
                    break;
                case misc_beamOn_cmd:   
                        MDB_GPIO_BeamPin(BEAM_INTERRUPT, GPIO_DRIVER_ON);
                    break;
                    
                default:
                    printf("function unknown\n");
            }
        }
        memset(&sUart,0, UART_BUFF_SIZE*sizeof(char));
    }

