mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
}
#pragma O2




void gpio_init(void) {
	//GPIO Init structure
//	GPIO_InitTypeDef GPIO_InitDef;
//	//Enable GPIOG peripheral clock for leds
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

//	GPIO_InitDef.GPIO_Pin = GPIO_Pin_4;		// this can be or'd
//	GPIO_InitDef.GPIO_OType = GPIO_OType_PP;
//	GPIO_InitDef.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitDef.GPIO_PuPd = GPIO_PuPd_NOPULL;
//	GPIO_InitDef.GPIO_Speed = GPIO_Speed_100MHz;
//	//Initialize pins
//	GPIO_Init(GPIOC, &GPIO_InitDef);
	
	// Init debug/timing IOs
//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);

//	GPIO_InitDef.GPIO_Pin = ((uint16_t)0x00ff);		// this can be or'd
//	GPIO_InitDef.GPIO_OType = GPIO_OType_PP;
//	GPIO_InitDef.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitDef.GPIO_PuPd = GPIO_PuPd_NOPULL;
//	GPIO_InitDef.GPIO_Speed = GPIO_Speed_100MHz;
//	//Initialize pins
//	GPIO_Init(GPIOE, &GPIO_InitDef);
	
}



/**< gpio_PA_init_output(GPIO_Pin_4 | GPIO_Pin_5);
 */
void resetPID (void) {
//	pid_Init(KP_INIT, KI_INIT, KD_INIT, TF_INIT, TS_US, &pidDataY, UNBUFFERED); @@@NOARMPID
//	calc_coeff(&pidDataY, BACK_SQUARE); @@@NOARMPID
}
void gpio_init_mco1(void) {
	//GPIO Init structure
	GPIO_InitTypeDef GPIO_InitDef;
	//Enable GPIOG peripheral clock for leds
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

	GPIO_InitDef.GPIO_Pin = GPIO_Pin_8;		// this can be or'd
	GPIO_InitDef.GPIO_OType = GPIO_OType_PP;
	GPIO_InitDef.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitDef.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitDef.GPIO_Speed = GPIO_Speed_100MHz;
	//Initialize pins
	GPIO_Init(GPIOA, &GPIO_InitDef);
}


void gpio_init_mco2(void) {
	//GPIO Init structure
	GPIO_InitTypeDef GPIO_InitDef;
	//Enable GPIOG peripheral clock for leds
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

	GPIO_InitDef.GPIO_Pin = GPIO_Pin_9;		// this can be or'd
	GPIO_InitDef.GPIO_OType = GPIO_OType_PP;
	GPIO_InitDef.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitDef.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitDef.GPIO_Speed = GPIO_Speed_100MHz;
	//Initialize pins
	GPIO_Init(GPIOC, &GPIO_InitDef);
}



/*    
#ifdef MULTI_SETPOINT
    if (g.setpointSrc == INTERNAL_SETPOINT) {
        W_now = pidDataY.W_int;
    }  else {
    if (g.setpointSrc == ANALOG_SETPOINT) {
        W_now = ADC_fBuff[INDEX_W];
    }  else {
    if (g.setpointSrc == REMOTE_SETPOINT) {
        W_now = pidDataY.W_rem;
    }  else {
    if (g.setpointSrc == REMOTE_OPENLOOP) {
        W_now = pidDataY.W_rem;
    }}}} 
#endif    
*/    













///*
// * File: main.c
// *
// * Code generated for Simulink model :pid_lib_v1.
// *
// * Model version      : 1.23
// * Simulink Coder version    : 8.5 (R2013b) 08-Aug-2013
// * TLC version       : 8.5 (Aug  6 2013)
// * C/C++ source code generated on  : Fri May 15 09:22:38 2015
// *
// * Target selection: stm32F4xx.tlc
// * Embedded hardware selection: STMicroelectronics->STM32F4xx 32-bit Cortex-M4
// * Code generation objectives: Unspecified
// * Validation result: Not run
// *
// *
// *
// * ******************************************************************************
// * * attention
// * *
// * * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
// * * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
// * * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
// * * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
// * * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
// * * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
// * *
// * ******************************************************************************
// */

//#include "adc_dac_dma.h"
//#include "arm_architect.h"
//#include "arm_math.h"
//#include "defines.h"
//#include "main.h"
//#include "mdb_gpio.h"
//#include "pid.h"
//#include "signalGen.h"
//#include <stdio.h>
//#include <stdlib.h>
//#include "stm32f4xx_adc.h"
//#include "stm32f4xx.h"
//#include <string.h>
//#include "tm_stm32f4_adc.h"
//#include "tm_stm32f4_dac.h"
//#include "tm_stm32f4_delay.h"
//#include "tm_stm32f4_disco.h"
//#include "tm_stm32f4_ds18b20.h"
//#include "tm_stm32f4_ili9341.h"
//#include "tm_stm32f4_onewire.h"
//#include "tm_stm32f4_pwm.h"
//#include "tm_stm32f4_stmpe811.h"
//#include "tm_stm32f4_timer.h"
//#include "tm_stm32f4_usart.h"
//#include "tools.h"


//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////          IMPORT from MATLAB code generated project pid_lib_v3
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//#include "pid_lib_v3.h"                /* Model's header file */
//#include "rtwtypes.h"                  /* MathWorks types */
//#include "stm32f4xx.h"

///* RCC_Configuration defined in RCC_Configuration.c file */
///* Clock configuration function provided as example */
//void RCC_Configuration(void);

///* Real-time model */
//extern RT_MODEL_pid_lib_v3 *const pid_lib_v3_M;

///* Set which subrates need to run this base step (base rate always runs).*/
///* Defined in pid_lib_v3.c file */
//extern void pid_lib_v3_SetEventsForThisBaseStep(boolean_T*);

///* Flags for taskOverrun */
//static boolean_T OverrunFlags[1];

///* Number of auto reload timer rotation computed */
//static uint32_t autoReloadTimerLoopVal_S = 10;

///* Remaining number of auto reload timer rotation to do */
//static uint32_t remainAutoReloadTimerLoopVal_S = 10;

///****************************************************
//   SysTick_Handler function
//   This handler is called every tick and schedules tasks
// *****************************************************/
//void SysTick_Handler(void);

//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////    END of    IMPORT from MATLAB code generated project pid_lib_v3
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


