mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
//static struct global g;
////static struct triangWave triStruct;
//static struct autoSaveSystem ass;

//static DAC_WritePointer_t (*DAC_SecureSetDualChanSigned) (int16_t, int16_t);

//// ==============================================================
////   This is needed in order to provide printf functionality
//// ==============================================================
//#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)

//struct __FILE { int handle; /* Add whatever you need here */ };
//FILE __stdout;
//    
//PUTCHAR_PROTOTYPE
//{
//    /* Place your implementation of fputc here */
//    /* e.g. write a character to the USART */
//    USART_SendData(USART1, (uint8_t) ch);

//    /* Loop until the end of transmission */
//    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
//    {}

//    return ch;
//}


//	
//// ==============================================================
////                         Prototypes 
//// ==============================================================
//void gpio_init(void);
//void exportInternalClks (void);
//void gpio_init_mco1(void);
//void gpio_init_mco2(void);
////static void Console (struct PID_DATA *pid, struct FPID_DATA *fpid, structType type);
//void resetPID (void);
////void consoleCase (struct PID_DATA *pid);
//void adc12_init (uint16_t gpio_pin_adc1, 
//								 uint16_t gpio_pin_adc2, 
//								 uint16_t EndOfConvInt, 
//								 ADC_TypeDef* ADCxEOT);
//void fastConsoleCase(arm_pid_instance_f32 *pid);

//int updateActuator_f(float I_set_x, float I_set_y);
//int beamCtrl(beamCtrlSource_t src, MDB_GPIO_STATE_t newState );


//#define RX_FRAME_PADDING_CHAR   '~'

///* The function pointer updateActuator is used as non-privileged access function 
// * to internal DAC output registers. After ass detects a tripping condition ,
// * updateActuator function-pointer targets to updateActuator_fused_callback */
////int (*updateActuator)                (float, float);
////int (*updateActuator_callback)       (float, float);
////int (*updateActuator_fused_callback) (float, float);
//// ==============================================================
////                  Compensator things
//// ==============================================================
//#define ALGO_OLD 				10
//#define ADJUSTING_SETPOINT	    11		// Stellungsalgorithmus
//#define SPEED_SETPOINT			12		// Geschwindigkeitsalgorithmus
//#define ALGORITHM 	ADJUSTING_SETPOINT

///** This is the factor used in the gui to enlarge resolution on int-only
// * QSlider ranges
// */
//#define SLIDER_VAL_DEVIDER  10000UL
////int SLIDER_VAL_DEVIDER  = 10000;


////@@@#pragma O0
//struct PID_DATA     pidDataX;
//struct PID_DATA     pidDataY;
//struct FPID_DATA    fpidData;

////@@@#pragma O2

//volatile float UNIT_MIKRO = 1/1000000;
//volatile int16_t pidOut = 0;

///**< ADC dual mode DMA receive buffer. */
//__IO int16_t ADC_MultiConvBuff[5];     
///* ADC values access buffer
// * Because we use a float based instance of PID, we need to cast the 
// * ADC_MultiConvBuff[0] buffer from integral type to float !!!
// */
//__IO float ADC_fBuff[5];     
///**< Define indices for ADC_MultiConvBuff[ ] acording to setpoint (INDEX_W) ans
// * process output (INDEX_P). */
//#ifndef INDEX_Py
//    #define INDEX_Px     0
//    #define INDEX_Py     1
//    #define INDEX_Ix     2
//    #define INDEX_W      3
//#endif
///* Acess macros for actual ADC values 
// * 
// * ToDo:    Maybe this macros needs to be atomic! 
// */
//#define POS_X_FLOAT         (float) ADC_fBuff[INDEX_Px]	/* actual position */
//#define POS_Y_FLOAT         (float) ADC_fBuff[INDEX_Py]	/* actual position */
//#define SETPOINT_Y_FLOAT	(float) ADC_fBuff[INDEX_W]	/* position we want to have */

//#define SIGNW -1

//#define INTERNAL_SETPOINT 
//#undef INTERNAL_SETPOINT 

//#pragma O0
//    //float temps[EXPECTING_SENSORS];
//    
//float pidErrBuff[2];        /* PID error buffer*/
//#define pidErr_x   pidErrBuff[0]
//#define pidErr_y   pidErrBuff[1]

//float toPlantBuff[2];        /* PID output buffer*/
//#define toPlant_x   toPlantBuff[0]
//#define toPlant_y   toPlantBuff[1]

//    float duty = 0;             /* Duty cycle for PWM */
//    arm_pid_instance_f32 PIDX;   /* ARM PID Instance, float_32 format */
//    arm_pid_instance_f32 PIDY;   /* ARM PID Instance, float_32 format */
//__IO float toPlant;              /* next actuator value in Volt */
//    int16_t toPlant_int;       /* next actuator value integral type */

//    int16_t test1 = UPPER_DAC_LIMIT_SIGNED;
//    int16_t test2 = LOWER_DAC_LIMIT_SIGNED;
//#pragma O2

///* Choose PID parameters */
//#define PID_PARAM_KP		0.5			/* Proporcional */
//#define PID_PARAM_KI		0.0		/* Integral */
//#define PID_PARAM_KD		0.0			/* Derivative */

//// ==============================================================
////                      beam interrupter
//// ==============================================================
// 
//// ==============================================================
////                ass - auto shutdown system
//// ==============================================================
//#define ASS_TRIPPING_LOWER_DEFAULT    -1.2f
//#define ASS_TRIPPING_UPPER_DEFAULT    1.2f
//#define ASS_SAFEVALUE_DEFAULT         0
//#define ASS_TRIPPING_TIME_DEFAULT    0.750f      // s


////#define ASS_100US                   100
//// ==============================================================
//// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//// ==============================================================
////      This indices HAVE TO STAY IN SYNC WITH Qt GUI SOURCES 
//// ==============================================================
//    volatile int NC = 3;		// index 0...2  (short command)
//    volatile int FS = 2;		// index 3...4	(fieldsep)
//    volatile int NV = 10;	    // index 5...14 (value)
//// ==============================================================
//// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//// ==============================================================
//    
//#define ////dbg(IO_PIN, LEVEL) ((LEVEL) == 1 ? \
//	 GPIO_WriteBit((GPIO_TypeDef*)DBG_IO, IO_PIN, Bit_SET) :\
//	 GPIO_WriteBit((GPIO_TypeDef*)DBG_IO, IO_PIN, Bit_RESET))

