mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
//#define ////dbgT(IO_PIN) TM_GPIO_TogglePinValue \
//                                ((GPIO_TypeDef*)DBG_IO, IO_PIN)

///* Define static usart strings used as GUI error / status messages  
// */
//#define  MSG_GUI_UART1_RECV_BUFF_FULL   "@GUI:usart1RecvBuffFull\n"  ///< Inform Gui about a full usart1 buffer
// 
//// ==============================================================
////            Signal generator things
//// ==============================================================

//uint16_t sinctr=0;
///*volatile uint16_t tab[1024];

////const int16_t sintab2[]= {0,110,220,329,437,543,647,748,846,941,1032,1119,1201,1279,1351,1418,1479,1534,1583,1626,1662,1692,1714,1730,1739,1741,1735,1723,1704,1678,1645,1606,1560,1508,1449,1385,1316,1241,1161,1076,987,894,798,698,595,490,384,275,165,55,-55,-165,-275,-384,-490,-595,-698,-798,-894,-987,-1076,-1161,-1241,-1316,-1385,-1449,-1508,-1560,-1606,-1645,-1678,-1704,-1723,-1735,-1741,-1739,-1730,-1714,-1692,-1662,-1626,-1583,-1534,-1479,-1418,-1351,-1279,-1201,-1119,-1032,-941,-846,-748,-647,-543,-437,-329,-220,-110,-0};

//    //int16_t sintab[]= { 0,262,519,769,1005,1225,1425,1601,1751,1873,
////									1963,2022,2047,2039,1997,1922,1816,1680,1516,
////									1328,1117,889,645,391,131,-131,-391,-645,-889,
////									-1117,-1328,-1516,-1680,-1816,-1922,-1997,-2039,
////								-2047,-2022,-1963,-1873,-1751,-1601,-1425,-1225,
////									-1005,-769,-519,-262,-0};
//*/
//// ==============================================================
//// ==============================================================
//// ==============================================================
//volatile uint16_t gW = 0;
//volatile uint16_t gY = 0;
//volatile uint16_t multiADC[2];

//volatile int16_t P_now, W_now;

//volatile float  KP_INIT  =	1;
//volatile float  KI_INIT, \
//                KD_INIT, \
//                TF_INIT = 0;



////float W_INT_BUFF[33]= { 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,0 };

////float *TEMP_WANT2 = W_INT_BUFF;	/* position we want to have */
////volatile uint32_t ct = 20000;

//volatile float setpoint_tgl = (1.25-0.4);


//// ==============================================================
////    IRQ callback:    DMA2_Stream0 transmission-complete
//// ==============================================================
////     PID: This callback initiates compensator calculation 
//// ==============================================================
//void DMA2_Stream0_IRQHandler(void) {
//    /**< Since this is the only irq flag for this handler, clear direct. */
//    DMA_ClearITPendingBit(DMA2_Stream0, DMA_IT_TC);
//    DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, DISABLE);

///*    
//    if (ct >= 5) {
//        ct--;
//    }
//    else {
//        ct = 100000;
//        if (setpoint_tgl >= (float)1.25) {
//            setpoint_tgl = (float)(1.25-0.05);
//        }
//        else {
//            setpoint_tgl = (float)(1.25+0.05);
//        }
//    }
//*/

///**< Das analoge symmetrische Positionssignal muss vor der AD- Wandlung einen positiven 
// * Offset erhalten wegen des Eingangsspannungsbereichs der intergrierten ADC-Zellen.
// * Analog wird also das sym. Pos. Signal um AREF/2 nach oben geschoben.
// * Hier wird der Offset digital wieder abgezogen damit auch Regler-Intern mit symmetrischen 
// * Sequenzen gearbeitet werden kann. 
// * 
// * ==>  Fuer die DAC-Hardware gilt das Gleiche, der +Offset (von vor ADC) wird also nach dem 
// *      DA-Wandler analog wieder subtrahiert. Darum muss dem intern symmetrischen Signal
// *      vor dem beschreiben des DAC-Data-hold-registers wieder AREF/2 aufaddiert werden.
// */
// 
///**< 
//* Take a copy of direct-memory-accessed array ADC_MultiConvBuff 
//* Up to this point, the access macros SETPOINT_Y_FLOAT, POS_Y_FLOAT ... 
//* also holds the new values 
//*/
//    for (__IO uint8_t k=0; k<4; k++) {
//        ADC_fBuff[k] = (float) ((float) (ADC_MultiConvBuff[k] - AN_OFFSET) * LSB);     
//    }

//// ==============================================================
////            Laser interrupter control
//// ==============================================================
///* To implement the functionality of blanking a setpoint vector, 
// * simply add a blanking information column to the setpoint 
// * datastream
// *
// * [x-coordinate; y-coordinate; blankingBit] 
// */

//// ==============================================================
////            Setpoint source selector
//// ==============================================================
//    while (1) {
//        if (g.setpointSrc == INTERNAL_SETPOINT) {   ///< Internal only, no remote offset or something else 
//            pidErr_x =  setpoint_tgl - POS_X_FLOAT;              
//            pidErr_y =  setpoint_tgl - POS_Y_FLOAT;              
//        }
//        if (g.setpointSrc == ANALOG_SETPOINT) {     ///< setpoint is sourced by analog input 
//                // flot conversion!
//        }
//        if (g.setpointSrc == REMOTE_SETPOINT) {     ///< Remote only, no internal signal or offset 
//            pidErr_x =  pidDataX.W_remf - POS_X_FLOAT;              
//            pidErr_y =  pidDataY.W_remf - POS_Y_FLOAT;              
//        }
//        if (g.setpointSrc == REMOTE_OPENLOOP) {     ///< PID bypassed, remote setpoint feed throgh 
//            updateActuator_f( /*pidDataY.W_remf*/ \
//                                pidDataY.W_remf, pidDataY.W_remf);
//            break;
//        }
//        if (g.setpointSrc == REMOTE_INTERNAL_MIXED) {     ///< Mixed mode, summing internal + external setpoint 
//            pidErr_x = ((float)(setpoint_tgl + pidDataX.W_remf)) - POS_X_FLOAT;
//            pidErr_y = ((float)(setpoint_tgl + pidDataY.W_remf)) - POS_Y_FLOAT;
//        }
//        if (  (g.setpointSrc != INTERNAL_SETPOINT) && (g.setpointSrc != ANALOG_SETPOINT)  && \
//              (g.setpointSrc != REMOTE_OPENLOOP)   && (g.setpointSrc == REMOTE_OPENLOOP) ) {
//             /* Error state, halt */
//             TM_DISCO_LedOn(LED_GREEN);
//             TM_DISCO_LedOn(LED_RED);
//        }
//        
//        /**< Calculate PID here */
//        ////dbg(DBG_PID_TIMING_PE6, hi);
////        updateActuator_f(   arm_pid_f32(&PIDY, pidErr_y), \
////                            arm_pid_f32(&PIDY, pidErr_y));
//        ////dbg(DBG_PID_TIMING_PE6, lo);

//        
//        break;
//    }    
//   
//   

//    /* Set LEDs according to which angular position is greater */
////    if ( POS_Y_FLOAT > SETPOINT_Y_FLOAT) {
////        TM_DISCO_LedOn(LED_GREEN);
////        TM_DISCO_LedOff(LED_RED);
////    } else if ( POS_Y_FLOAT <  SETPOINT_Y_FLOAT) {
////        TM_DISCO_LedOn(LED_RED);
////        TM_DISCO_LedOff(LED_GREEN);
////    } else {
////        TM_DISCO_LedOff(LED_ALL);
////    }
//   
//}

