mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
//// ==============================================================
////     IRQ callback:    ADC end-of-conversion 
//// ==============================================================
//void ADC_IRQHandler(void) {
//    if (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == SET) {
//        ADC_ClearITPendingBit(ADC1, ADC_IT_EOC);
//        /* End of conversion interrupt occured */
//        ////dbg(DBG0, lo);
//        uint16_t W_now = ADC_MultiConvBuff[1];   // setpoint (Isens_y)
//        return;
//    }
//    
//   
//    if (ADC_GetFlagStatus(ADC1, ADC_FLAG_AWD) == SET) {
//        ADC_ClearITPendingBit(ADC1, ADC_IT_AWD);
//        if ((ass.state == ASS_STATIONARY_INTEGRATOR) ||
//            (ass.state == ASS_DISCHARGING_INTEGRATOR)) {
//            ass.state = ASS_CHARGING_INTEGRATOR;
//            printf("ASS:charging_start...\n");
//        }
//    /* Analog watchdog interrupt occured */
//        if ((ass.integrator <= ass.lowerVal) || (ass.integrator >= ass.upperVal)) {   /**< check for integrator limit */
//            if (! ass.tripped) {
//                ass.tripped = 1;                    /**< Set "tripped" state if it is so */
//                DAC_SecureSetDualChanSigned = \
//                      &DAC_SetDualChanSigned_Tripped;  /**< set function pointer to the "ass tripped" handler*/
//            }
//            return;
//        }
//        else {                                  /**< else increment integrator */
//            ass.integrator+= ass.upperVal * (double)TS_US*1e-6/(ass.tripTime);
//        }
//        return;
//    }
//    printf("bad ADC IntReq source\n");
//}
//	
//// ==============================================================
////     IRQ callback:    Timer 2 overrun 
//// ==============================================================
//void TIM2_IRQHandler(void) {
//	////dbgT(DBG2);
////	GPIO_ToggleBits(DBG_IO, DBG4);
//	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
//		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

//        ////dbg(DBG4, lo);
//        DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, ENABLE);
//        
////        if (ass.stateCtr >= (uint8_t)(ASS_100US / TS_US)) {
////            ass.stateCtr = 0;
////            if (ass.integrator > 0) {
////                ass.state = ASS_DISCHARGING_INTEGRATOR;
////                ass.tripped = 0;
////                ass.integrator -= ass.upperVal * (double)TS_US*1e-6/(ass.tripTime);
////            }
////        }
//	}
//    else
//        while (1);;
//}


//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////        IMPORT from MATLAB code generated project pid_lib_v3
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//#pragma O0
//// ==============================================================
////     IRQ callback:    SysTick Interrupt
//// ==============================================================
//void SysTick_Handler(void)
//{
//    uint16_t ypid_uint=0;
//    int16_t ypid_int=0;
//    /* Manage nb of loop before interrupt has to be processed */
//    remainAutoReloadTimerLoopVal_S--;
//    if (remainAutoReloadTimerLoopVal_S) {
//        return;
//    }

//    remainAutoReloadTimerLoopVal_S = autoReloadTimerLoopVal_S;

//    /* Check base rate for overrun */
//    if (OverrunFlags[0]) {
//        rtmSetErrorStatus(pid_lib_v3_M, "Overrun");
//        return;
//    }

//    OverrunFlags[0] = TRUE;

//    /* Step the model for base rate */
//    pid_lib_v3_step();
//    
//    /* Get model outputs here */
//    ypid_int = decodeDbl_toInt( pid_lib_v3_Y.Ypid );
//    ypid_uint = ypid_int + AN_OFFSET;
//    DAC_SetDualChanSigned( ypid_uint, ypid_uint );
//    
//    /* Indicate task for base rate complete */
//    OverrunFlags[0] = FALSE;
//}
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////    END of    IMPORT from MATLAB code generated project pid_lib_v3
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//#pragma O1


//int main (void)
//{
//   /**< Define private main variables */
////    TM_PWM_TIM_t TIM_Data;    ///< Timer data for PWM 

//  /* Clock has to be configured first*/
////  RCC_Configuration();
//   SystemInit();       /**< Initialize system. */
//    TM_DELAY_Init();    /**< Initialize Delay library. */

//   /**< Initialize discovery button and leds */
//    TM_DISCO_ButtonInit();

//    /* Initialize Leds */
//    TM_DISCO_LedInit();

//   /**< Initialize USART1-> TX: PA9, RX: PA10. */
//    TM_USART_Init(USART1, TM_USART_PinsPack_1, 115200);			

////   /**< Initialize TIM3, 1kHz frequency */
////    TM_PWM_InitTimer(TIM3, &TIM_Data, 1000);

////   /**< Initialize TIM2, Channel 1, PinsPack 2 = PA5 */
////    TM_PWM_InitChannel(&TIM_Data, TM_PWM_Channel_3, TM_PWM_PinsPack_2);  // ???? PB0

////    /* Set default duty cycle */
////    TM_PWM_SetChannelPercent(&TIM_Data, TM_PWM_Channel_3, duty);

////    TM_ADC_Init(ADC1, ADC_X_CHANNEL);
////    TM_ADC_Init(ADC1, ADC_Y_CHANNEL);
//   
//    MDB_GPIO_Init();    ///< Init interrupter GPIOs

//                                
//   /**< Initialize autoShutdown system struct. */
//    ass.lowerVal = ASS_TRIPPING_LOWER_DEFAULT;
//    ass.upperVal = ASS_TRIPPING_UPPER_DEFAULT;
//    ass.lowerVal = -1.25;
//    ass.upperVal = 1.25;
//    
//    ass.integrator = 0;
//    ass.safeVal = ASS_SAFEVALUE_DEFAULT ;
//    ass.tripped = 0;
//    ass.ack = 0;
//    ass.tripTime = ASS_TRIPPING_TIME_DEFAULT; // 750ms initial
//    ass.state = ASS_STATIONARY_INTEGRATOR;
//    ass.stateCtr = 0;
//    
//   /**< Initialize global structure */
//    g.waveForm = NN; g.duty = 999; g.freq = 999; g.lookAt = 999;
//    g.dacHw[TM_DAC1].upperLim = (int16_t)( 2113 - ADC_RNG/2 );
//    g.dacHw[TM_DAC1].lowerLim = (int16_t)( 1917 - ADC_RNG/2 );
//    g.dacHw[TM_DAC2].upperLim = (int16_t)( 2113 - ADC_RNG/2 );
//    g.dacHw[TM_DAC2].lowerLim = (int16_t)( 1917 - ADC_RNG/2 );
//    g.setpointSrc = REMOTE_INTERNAL_MIXED;
//    g.refresh = 20;    
//    g.beamEnabled = GPIO_ON;

//    
//   /**< Transmitt bootup message to UART1 */
//    char *tok;
//    char *delimit = "\\";
//    tok = strtok(__FILE__, delimit);
//    tok = strtok (NULL, delimit);

