mainster/sw4stm32_workbench/21-STM32F4_PRJ_GALVO_lib_v1.4/src/STM32F4xx_pid_lib_v1_3.c
//    printf("\n\n--- %s ---\n", tok);
//    printf("--- Compiled: %s  %s ---\n\n", __DATE__, __TIME__);
////    printf("__TARGET_ARCH_ARM: %s\n", TARGET_ARCH_ARM[__TARGET_ARCH_ARM]);
//    printf("__BASE_FILE__: %s\n", __BASE_FILE__);
// 
// 
//   /**< Initialize DAC outputs DAC1-> PA4  DAC2-> PA5 */
//    TM_DAC_Init(TM_DAC1);       
//    TM_DAC_Init(TM_DAC2);       

//    printf("connect Write pointer to DAC output register\n");
//    DAC_SecureSetDualChanSigned = &DAC_SetDualChanSigned;    
//    
//    
//   /**< Initialize TIM2 as part of sampling hardware */
//    TM_Timer2_config(DISABLE, ENABLE, SAMPLE_INTERVAL);
//    ADC_ContScanMode_w_DMA_timeTrigd( ADC_MultiConvBuff, 4);
//    
//   /**< Set threshold for analog watchdog */
//    ADC_AnalogWatchdogThresholdsConfig(ADC1,    
//                                decode_toUint(ass.upperVal + AREF_BY2), 
//                                decode_toUint(ass.lowerVal + AREF_BY2));
// 
// /* ================================================================================ */       
///**< ===============     ENABLE_ON_POWER-ON-SEQUENCE     ======================================== */       
///* ================================================================================ */       

//	TIM_Cmd(TIM3, ENABLE);          ///< Enable PWM timer 3
//    TIM_Cmd(TIM2, ENABLE);          ///< Enable sampling timer 2
//    ADC_DMACmd(ADC1, ENABLE);       ///< Enable DMA functionality
//    ADC_Cmd(ADC1, ENABLE);          ///< Enable onboard hardware ADC 1
//    ADC_SoftwareStartConv(ADC1);    ///< Trigger the regular group scan 
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////        IMPORT from MATLAB code generated project pid_lib_v3
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//  /* Data initialization */
//  int_T i;
//  for (i=0;i<1;i++) {
//    OverrunFlags[i] = 0;
//  }

//  /* Clock has to be configured first*/
// // RCC_Configuration();

//  /* Model initialization call */
//  pid_lib_v3_initialize();

//   

//  /* Systick configuration and enable SysTickHandler interrupt */
//  if (SysTick_Config((uint32_t)(SystemCoreClock * TS_US))) {
//    autoReloadTimerLoopVal_S = 1;
//    do {
//      autoReloadTimerLoopVal_S++;
//    } while ((uint32_t)(SystemCoreClock * TS_US)/autoReloadTimerLoopVal_S >
//             SysTick_LOAD_RELOAD_Msk);

//    SysTick_Config((uint32_t)(SystemCoreClock * TS)/autoReloadTimerLoopVal_S);
//  }

//  remainAutoReloadTimerLoopVal_S = autoReloadTimerLoopVal_S;//Set nb of loop to do
// 

//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////    END of    IMPORT from MATLAB code generated project pid_lib_v3
//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//    TM_DISCO_LedOn(LED_GREEN);
//    TM_DISCO_LedOn(LED_RED);
//    TM_DISCO_LedOff(LED_GREEN);
//    TM_DISCO_LedOff(LED_RED);
//    
//  /* Infinite loop */
//  /* Real time from systickHandler */
//    while (1) {
//        while (! TM_DISCO_ButtonOnPressed()) {};
//        TM_DISCO_LedOn(LED_RED);

//        while (! TM_DISCO_ButtonOnPressed()) {
//            printf("x: % 1.6f  y: % 1.6f\n", ADC_fBuff[INDEX_Px], ADC_fBuff[INDEX_Py]);
//            Delayms(100);
//        }
//         pid_lib_v3_P.pulseGenEN_CurrentSetting = 0x01;
//         printf("pid_lib_v3_P.pulseGenEN_CurrentSetting = 0x01\n");

//        while (! TM_DISCO_ButtonOnPressed()) {
//        }
//    }
//}
///* File trailer for Real-Time Workshop generated code.
// *
// * [EOF] main.c
// */


///** 
// * @brief   Set beam control source and new state
// */ 
//int beamCtrl(beamCtrlSource_t src, MDB_GPIO_STATE_t newState ) {
//    if ((src == BEAM_CTRL_SOURCE_GLOBAL) && (newState != DNI)) {
//        printf("Error, Beam source can't be GLOBAL if new state is not DNI");
//        return -1;
//    }

//    if ((src == BEAM_CTRL_SOURCE_GLOBAL) && (newState == DNI)) {
//        MDB_GPIO_Switch(BEAM_INTERRUPT, g.beamEnabled);
//        return 0;
//    }

//    if (src == BEAM_CTRL_SOURCE_MANUAL) {
//        MDB_GPIO_Switch(BEAM_INTERRUPT, newState);
//        return 0;
//    }
//    
//    return -1;
//}



///**
// * @brief   Safely update actuator control signals
// * Safely means in terms of missplaced or oscillating controller outputs.
// * The analog watchdog peripheral takes care about "out of normal range" 
// * events. If a converted position signal is out of range, the watchdog 
// * handler starts time integration and after "out of range" integrator 
// * reaches a defineable limit, the watchdog takes the system to into
// * "Tripped" state.
// * Therefor a global error flag becomes true AND the function pointer
// * DAC_SetDualChanSigned() that points to a wraper function, gots to be
// * replaced by a pointer that points to DAC_SetDualChanSigned_Tripped().
// * In the DAC_SetDualChanSigned() function, that is pointed to in tripped 
// * state, only outputs a zero level DAC-Signal to take external hardware 
// * in a safe state.
// */
//int updateActuator_f(float I_set_x, float I_set_y) {
//    int toPlant_intBuff[2] = { 0, 0 };
//    int *toPlant_int = &toPlant_intBuff[0];
//    
//    if (!ass.tripped) {     ///< only if ass state is NOT tripped

//        /**< decode the float values to an integral type */
//        *toPlant_int     = decode_toInt(I_set_x);
//        *(toPlant_int+1) = decode_toInt(I_set_y);

//        /**
//         * Check decoded values to be in DAC output range. Clipping 
//         * would be necessary 
//         */
//        for (uint8_t k=0; k<2; k++) {
//            if (*(toPlant_int+k) > UPPER_DAC_LIMIT_SIGNED)
//                    *(toPlant_int+k) = UPPER_DAC_LIMIT_SIGNED;
//            if (*(toPlant_int+k) < LOWER_DAC_LIMIT_SIGNED)
//                    *(toPlant_int+k) = LOWER_DAC_LIMIT_SIGNED;
//        }
//    } 
//    else{   
//    /**<><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>    
//       <>  This branch eror-handles an ass integrator_full event i.e.<>
//       <><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>    
//       <>                    FUSE TRIPPED                            <>
//       <><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<> */  
//       /* All safety related actions are done by the watchdog handler */ 
//    }

//   /**
//    * @brief    Return argument toPlant_int is of type int16_t because 
//    *           it holds the --un--biased DAC output register values...
//    *           This is a function pointer!
//    * Casting from (float32_t) toPlant to int16_t type introduces 
//    * rounding errors which couldn't be prevented! 
//    */
//    DAC_SecureSetDualChanSigned( *toPlant_int, *(toPlant_int+1));  
//        
//    return 0;
//}
